{
  "intro": {
    "socialIcons": [
      {
        "alt": "GitHub Link",
        "link": "https://github.com/gabriel-rusu",
        "iconSrc": "github.svg"
      },
      {
        "alt": "LinkedIn Link",
        "link": "https://www.linkedin.com/in/grusu13",
        "iconSrc": "linkedin.svg"
      },
      {
        "alt": "Instagram Link",
        "link": "https://www.instagram.com/gabriel.rusu.dev",
        "iconSrc": "instagram.svg"
      }
    ]
  },
  "about": {
    "description": "I am a team lead and software engineer with a rich blend of technical expertise and leadership experience. With a foundation in systems engineering and a master’s degree in Artificial Intelligence, I bring a forward-thinking approach to solving complex problems. I specialize in designing scalable, efficient software solutions while fostering collaborative, high-performing teams.\n\nMy passion lies in bridging practical engineering skills with innovative AI-driven strategies to deliver impactful results. From leading the development of enterprise-grade applications to mentoring teams and streamlining workflows, I thrive in creating solutions that blend technical excellence with user-centric design.\n\nBeyond my professional life, I am deeply passionate about continuous learning and exploration. Whether I’m hiking in nature, diving into a good book, traveling to new places, or experimenting with cutting-edge technology, I am always looking for opportunities to grow.\n\nMore details about my experience, achievements, and projects are available as you scroll."
  },
  "experience": [
    {
      "position": "Team Lead & Software Engineer",
      "company": "CBN International Europe",
      "jobDescription": {
        "techStack": [
          "Java",
          "Angular",
          "TypeScript",
          "JavaScript"
        ],
        "responsibilities": [
          "Code review",
          "Fixing production problems",
          "Contributing to ongoing projects",
          "Mentored & helped internship colleagues with the problems they encountered",
          "Estimating the time needed to implement the requested features and assigning some of the tasks to other colleagues",
          "Break down the documentation and client requests into tasks and sub-tasks.",
          "Meeting the projects deadlines",
          "Offering technical support  for other colleagues"
        ],
        "achievements": [
          "Directed a team of 4 software developers through the full lifecycle of the Vehicle Registration Portal, enabling leasing companies to provisionally register vehicles on behalf of individuals, with a focus on data aggregation capabilities tailored for leasing companies.",
          "Enhanced the provisional registration process for new vehicles by replacing the manual completion of owner details with a personalization app that records the information in the system and prints the owner details directly onto the blank authorization form.",
          "Automated vehicle data entry for the national provisional vehicle registration system, significantly increasing efficiency for millions of users. Independently implemented external validation for new vehicle registrations and upgraded both frontend and backend applications to support this functionality.",
          "Improved application performance by eliminating redundant database queries and strengthened system resilience using JMS, RabbitMQ, and dead-letter queues to manage user information and configurations effectively."
        ],
        "summary": [
          "Led a team of 4 developers, overseeing project lifecycle and task delegation.",
          "Reviewed code, mentored interns, and provided technical support.",
          "Directed the development of a Vehicle Registration Portal for leasing companies.",
          "Automated vehicle registration processes, increasing efficiency and accuracy.",
          "Optimized application performance by reducing redundant database queries and implementing RabbitMQ for resilience."
        ]
      },
      "timePeriod": {
        "startDate": "03/07/2023",
        "endDate": "Present"
      }
    },
    {
      "position": "Software Engineer",
      "company": "CBN International Europe",
      "jobDescription": {
        "techStack": [
          "Java",
          "Angular",
          "TypeScript",
          "JavaScript"
        ],
        "responsibilities": [
          "Code review",
          "Provided support for code troubleshooting and debugging",
          "Participated in daily stand-ups, sprint planning, and retrospectives",
          "Mentored & helped internship colleagues with the problems they encountered"
        ],
        "achievements": [
          "Contributed to the development of the updated Vehicle Registration app, enabling operators to work more efficiently and reducing the time required to register a vehicle by 50%.",
          "Led the mentoring of the internship team, guiding them in building the workspace-booking app, now actively used internally for seat management in the new office.",
          "Designed and implemented a debug mode, providing developers with insights into UI data processing and improving issue identification and resolution.",
          "Created an efficient caching mechanism using RxJS to prevent the repeated loading of large dictionaries (e.g., streets), significantly enhancing UI performance.",
          "Strengthened collaboration with the QA team by introducing new practices among developers, resulting in improved bug resolution processes for shared libraries."
        ],
        "summary": [
          "Debugged and reviewed code, mentored interns, and supported QA efforts.",
          "Contributed to the development of a Vehicle Registration app and workspace booking app.",
          "Created a caching mechanism to optimize UI performance.",
          "Enhanced bug-handling practices by fostering collaboration between QA and development teams."
        ]
      },
      "timePeriod": {
        "startDate": "01/12/2019",
        "endDate": "03/07/2023"
      }
    }
  ],
  "education": [
    {
      "degree": "Master's degree, Artificial Intelligence",
      "faculty": "Faculty of Automatic Control and Computers",
      "university": "UNIVERSITY POLITEHNICA OF BUCHAREST",
      "timePeriod": {
        "startDate": "03/10/2022",
        "endDate": "11/09/2024"
      },
      "description": "I worked on a variety of projects across different subfields of AI and gained experience in handling real-world constraints using advanced model architectures. Throughout my work in Computer Vision, Deep Learning, Data Science, Natural Language Processing, and Advanced AI Techniques, I implemented a wide range of projects. These ranged from simpler tasks, such as predicting stock prices for various companies, to more complex ones like pedestrian tracking and detection and autonomous drone flight.",
      "achievements": [
        "earned merit scholarship for my academic performance",
        "implemented an autonomous drone system during the Introduction to Robotics class. The system had to work under a lot of constrains in real-time on limited hardware resources.",
        "developed a new model for Pedestrian Tracking and Detection which was more efficient than the current approaches on limited hardware."
      ],
      "finalGrade": "10"
    },
    {
      "degree": "Bachelor's degree, Systems Engineering",
      "faculty": "Faculty of Automatic Control and Computers",
      "university": "UNIVERSITY POLITEHNICA OF BUCHAREST",
      "timePeriod": {
        "startDate": "25/09/2017",
        "endDate": "04/07/2021"
      },
      "description": "I studied a broad range of courses from Programming Languages (C) and Object Oriented Programming (C++) to Operating Systems, Advanced Computing Architectures and Web Apps developed in Java. During this period I developed a lot as a Developer and as a person building a lot of apps and learning from my mistakes.",
      "achievements": [
        "earned merit scholarship for my academic performance",
        "competed in multiple hackathons and placed 3rd in the DevHacks Hackathon",
        "completed a Game Dev bootcamp organized by GameLoft where I developed a game engine and learned all the nits and bolts of how game engines work"
      ],
      "finalGrade": "9.37"
    }
  ]
}
