{
  "intro": {
    "socialIcons": [
      {
        "alt": "GitHub Link",
        "link": "https://github.com/gabriel-rusu",
        "iconSrc": "github.svg"
      },
      {
        "alt": "LinkedIn Link",
        "link": "https://www.linkedin.com/in/grusu13",
        "iconSrc": "linkedin.svg"
      },
      {
        "alt": "Instagram Link",
        "link": "https://www.instagram.com/gabriel.rusu.dev",
        "iconSrc": "instagram.svg"
      }
    ]
  },
  "about": {
    "description": "I’m a team lead and software engineer, blending practical systems engineering skills with strategic team leadership. My master’s degree in AI adds depth to my technical background, making me open to incorporating innovative AI-driven approaches where they align with project goals.",
    "passions": [
      "code",
      "hike",
      "read",
      "travel"
    ]
  },
  "experience": [
    {
      "position": "Team Lead & Software Engineer",
      "company": "CBN International Europe",
      "jobDescription": {
        "techStack": [
          "Java",
          "Angular",
          "TypeScript",
          "JavaScript"
        ],
        "responsibilities": [
          "Code review",
          "Fixing production problems",
          "Contributing to ongoing projects",
          "Offering technical support for other colleagues"
        ],
        "achievements": [
          "Worked on implementing some of the most important applications for the Romanian DMV system",
          "Organized, scheduled, and managed a team of 4 in implementing new apps that allow dealers to provisionally register new cars online",
          "Designed a pleasant and intuitive UI for the new apps"
        ]
      },
      "timePeriod": {
        "startDate": "03/07/2023",
        "endDate": "Present"
      }
    },
    {
      "position": "Software Engineer",
      "company": "CBN International Europe",
      "jobDescription": {
        "techStack": [
          "Java",
          "Angular",
          "TypeScript",
          "JavaScript"
        ],
        "responsibilities": [
          "Developed and maintained backend services and APIs to support front-end applications",
          "Collaborated with cross-functional teams on feature planning and implementation",
          "Participated in daily stand-ups, sprint planning, and retrospectives",
          "Provided support for code troubleshooting and debugging"
        ],
        "achievements": [
          "Played a key role in developing an online vehicle registration system used across multiple regions",
          "Improved codebase efficiency, reducing runtime by 20%",
          "Promoted code quality by implementing a standardized testing suite"
        ]
      },
      "timePeriod": {
        "startDate": "01/12/2019",
        "endDate": "03/07/2023"
      }
    }
  ],
  "education": [
    {
      "degree": "Master's degree, Artificial Intelligence",
      "faculty": "Faculty of Automatic Control and Computers",
      "university": "UNIVERSITY POLITEHNICA OF BUCHAREST",
      "timePeriod": {
        "startDate": "03/10/2022",
        "endDate": "11/09/2024"
      },
      "description": "I worked on a variety of projects across different subfields of AI and gained experience in handling real-world constraints using advanced model architectures. Throughout my work in Computer Vision, Deep Learning, Data Science, Natural Language Processing, and Advanced AI Techniques, I implemented a wide range of projects. These ranged from simpler tasks, such as predicting stock prices for various companies, to more complex ones like pedestrian tracking and detection and autonomous drone flight.",
      "achievements": [
        "earned merit scholarship for my academic performance",
        "implemented an autonomous drone system during the Introduction to Robotics class. The system had to work under a lot of constrains in real-time on limited hardware resources.",
        "developed a new model for Pedestrian Tracking and Detection which was more efficient than the current approaches on limited hardware."
      ],
      "finalGrade": "10"
    },
    {
      "degree": "Bachelor's degree, Systems Engineering",
      "faculty": "Faculty of Automatic Control and Computers",
      "university": "UNIVERSITY POLITEHNICA OF BUCHAREST",
      "timePeriod": {
        "startDate": "25/09/2017",
        "endDate": "04/07/2021"
      },
      "description": "I studied a broad range of courses from Programming Languages (C) and Object Oriented Programming (C++) to Operating Systems, Advanced Computing Architectures and Web Apps developed in Java. During this period I developed a lot as a Developer and as a person building a lot of apps and learning from my mistakes.",
      "achievements": [
        "earned merit scholarship for my academic performance",
        "competed in multiple hackathons and placed 3rd in the DevHacks Hackathon",
        "completed a Game Dev bootcamp organized by GameLoft where I developed a game engine and learned all the nits and bolts of how game engines work"
      ],
      "finalGrade": "9.37"
    }
  ]
}
